# IsReaction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadBase..::..IsReaction Property
LoadBase Class See Also
---
The load is reaction option.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsReaction { get; set; }
```

Visual Basic
---
```text
Public Property IsReaction As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsReaction {
	bool get ();
	void set (bool value);
}
```

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace